Examinator/src/Catalogs/ПодборкиСУЗ/ПодборкиСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПодборкиСУЗ</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ЭтоТест</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПрезентация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыбиратьЭлементыИзРубрикатора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяТеста</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Карта</name>
    <type>
      <types>CatalogRef.КартыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>КлассификационнаяГруппировка</name>
    <type>
      <types>CatalogRef.КлассификационныеГруппировкиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопыток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПеремешиватьГруппыЭлементов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПереходитьВпередАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьКлассификатор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьНавигацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьСтартовуюСтраницу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеЭлементов</name>
    <type>
      <types>EnumRef.ВариантыПредставленияЭлементовПодборкиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СвернутьРазделы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНавигации</name>
    <type>
      <types>EnumRef.ТипыНавигацииПодборкиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоГруппЭлементов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтартовыйРесурс</name>
    <type>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыравниваниеСтартовогоРесурса</name>
    <type>
      <types>EnumRef.СпособыВыравниванияСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеТестирования</name>
    <type>
      <types>EnumRef.НазначенияТестированийСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСложностиПоУмолчанию</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСложностиПоУмолчанию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьТаймер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматТаймера</name>
    <type>
      <types>EnumRef.ФорматыТаймераСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийФинальныйКомментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийФинальныйРесурс</name>
    <type>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>НумероватьСтраницы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьПредыдущиеПопытки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсключитьОткрытыеВопросы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьСтоимостьВопроса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрытьКомментарииВопросов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнформацияНаФинальнойСтранице</name>
    <type>
      <types>EnumRef.ИнформацияНаФинальнойСтраницеТестаСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Презентация</name>
    <type>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УдалитьГруппыПодчиненныхЭлементов</name>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.ФреймыСУЗ</types>
        <types>CatalogRef.СтраницыСУЗ</types>
        <types>CatalogRef.РесурсыСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СкрытыеРесурсы</name>
    <attributes>
      <name>Ресурс</name>
      <type>
        <types>CatalogRef.РесурсыСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/InformationRegisters/ДанныеФайлыСУЗ/ДанныеФайлыСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеФайлыСУЗ</name>
  <resources>
    <name>ПрисоединенныйФайл</name>
    <type>
      <types>CatalogRef.ФайлыСУЗПрисоединенныеФайлы</types>
    </type>
  </resources>
  <resources>
    <name>ТекстовыеДанные</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ДвоичныеДанные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеОбмена</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>РасширениеФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>СсылкаНаОбъектСУЗ</name>
    <type>
      <types>CatalogRef.ФайлыСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Версия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/ТипыНавигацииПодборкиСУЗ/ТипыНавигацииПодборкиСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНавигацииПодборкиСУЗ</name>
  <enumValues>
    <name>Последовательно</name>
  </enumValues>
  <enumValues>
    <name>ВыпадающимМеню</name>
  </enumValues>
  <enumValues>
    <name>ВыпадающимСписком</name>
  </enumValues>
  <enumValues>
    <name>Переключатели</name>
  </enumValues>
  <enumValues>
    <name>Слайды</name>
  </enumValues>
  <enumValues>
    <name>НаОднойСтранице</name>
  </enumValues>
  <enumValues>
    <name>БезНавигации</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Catalogs/ФайлыСУЗ/ФайлыСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФайлыСУЗ</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.РесурсыСУЗ</owners>
  <attributes>
    <name>FlashВерсия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FlashЦветФона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Версия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Выравнивать</name>
    <type>
      <types>EnumRef.СпособыВыравниванияСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОткрыватьПоСсылке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрыватьВнешнимПриложением</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Скрывать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипФайла</name>
    <type>
      <types>EnumRef.ТипыФайловСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроигрыватьАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнийФайл</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрыватьОбработкуМодально</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрыватьОбработкуБезопасно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонДокумента</name>
    <type>
      <types>CatalogRef.ШаблоныДокументовСУЗ</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/Catalogs/ПодборкиСУЗ/Forms/ФормаПрезентации/Module.bsl
#Область ПеременныеФормы

&НаКлиенте
Перем Приложение; // Объект COM приложения и другие его свойства

&НаКлиенте
Перем РабочийКаталог; // Каталог для хранения документа и его копии

&НаКлиенте
Перем ПропуститьЗаписьДокумента; // Обработчик ПриЗаписиДокумента не будет срабатывать

&НаКлиенте
Перем ПропуститьСохранениеДокумента; // Процедура СохранитьДокумент из обработчика ПередЗаписью не будет срабатывать

#КонецОбласти

#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	
	ЭлектронныйРесурс = Параметры.ЭлектронныйРесурс;
	ЭлементСодержания = Параметры.ЭлементСодержания;
	
	РазработкаСУЗ.УстановитьРодителяНовогоОбъекта(Объект, Параметры, "СправочникСсылка.ПодборкиСУЗ");
	
	Если Объект.Ссылка.Пустая() Тогда		
		Объект.ЭтоПрезентация = Истина;
		Объект.ТипНавигации = Перечисления.ТипыНавигацииПодборкиСУЗ.Слайды;
	КонецЕсли;
	
	РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(Объект);
	
	ОбновитьСсылкуНаЗагруженныйФайл();
	
	Если Объект.Ссылка.Пустая() Тогда
		Заголовок = НСтр("ru = 'Презентация (создание)'");
	Иначе
		Заголовок = Объект.Наименование;
	КонецЕсли;
	
	// Для веб-кабинета
	
	МассивЭлементовНеподдерживаемыхПлееромВебКабинета = Новый Массив;
	МассивЭлементовНеподдерживаемыхПлееромВебКабинета.Добавить(Элементы.Шаблон);
	
	РазработкаСУЗ.УбратьВидимостьНеподдерживаемыхПлееромВебКабинетаЭлементов(ЭлектронныйРесурс, МассивЭлементовНеподдерживаемыхПлееромВебКабинета);
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РазработкаСУЗКлиент.УстановитьКонтекстЭлектронногоРесурса(ЭтотОбъект);
	
	Элементы.ФормаОткрытьПрезентацию.Видимость = РазработкаСУЗКлиент.ЕстьПоддержкаДокументов();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)	
	
	ОбновитьКоличествоСлайдов();
		
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

	ДокументДоступен = ПрезентацияДоступна();
	
	Если НЕ ДокументДоступен И Объект.Ссылка.Пустая() И НЕ ПропуститьСохранениеДокумента Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Перед записью откройте новый документ'"));
		
		Отказ = Истина;
		
		Возврат;
		
	КонецЕсли;
	
	Если ДокументДоступен И НЕ ПропуститьСохранениеДокумента Тогда
		СохранитьДокумент(Истина);
	КонецЕсли;
	
	ПропуститьСохранениеДокумента = Ложь;	
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Для каждого Параметр Из ПараметрыЗаписи Цикл
		ТекущийОбъект.ДополнительныеСвойства.Вставить(Параметр.Ключ, Параметр.Значение);	
	КонецЦикла;	

КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(ЭлементСодержания) Тогда
		Справочники.СодержаниеСУЗ.Перезаписать(ЭлементСодержания);
	КонецЕсли;	

	Справочники.ПодборкиСУЗ.ОбновитьПрезентацию(ТекущийОбъект.Ссылка, ЭлектронныйРесурс, ФайлыДляСохранения, ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьСсылкуНаЗагруженныйФайл();
	
	ОбновитьКоличествоСлайдов();
	
	ФайлыДляСохранения = Неопределено;
	
	Заголовок = Объект.Наименование;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ОбъектСУЗЗаписан", Объект.Ссылка, ЭтотОбъект);
	
	Если ЗначениеЗаполнено(ЭлектронныйРесурс) Тогда
		Оповестить("ЭлектронныйРесурсОбновлен", ЭлектронныйРесурс, ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Если ДокументМодифицирован() Тогда
		Модифицированность = Истина;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	Если Приложение <> Неопределено Тогда

		Если Приложение.Пользовательское <> Неопределено Тогда

			Попытка
				УдалитьОбработчик Приложение.Пользовательское.PresentationBeforeSave, ПередЗаписьюПрезентации;	
			Исключение		
			КонецПопытки;
			
			Если Приложение.Презентация <> Неопределено Тогда
			
				//Попытка
					Приложение.Презентация.Close();
				//Исключение		
				//КонецПопытки;
				
			КонецЕсли;						
			
			//Попытка	
				Приложение.Пользовательское.Quit();
			//Исключение		
			//КонецПопытки;

		КонецЕсли;			
		
		Если Приложение.Скрытое <> Неопределено Тогда
		
			//Попытка
				Приложение.Скрытое.Quit();
			//Исключение		
			//КонецПопытки;

		КонецЕсли;					
		
		
		Приложение = Неопределено;

	КонецЕсли;
		
	Если РабочийКаталог <> Неопределено Тогда
		
		Попытка
			УдалитьФайлы(РабочийКаталог.Путь);
		Исключение		
		КонецПопытки;
		
	КонецЕсли;


КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

#КонецОбласти

#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ОткрытьПрезентацию(Команда)

	#Если НЕ ВебКлиент Тогда

	Если НЕ РазработкаСУЗКлиент.ЕстьПоддержкаДокументов() Тогда	
		Возврат;
	КонецЕсли;
	
	// Инициализируем приложение
	//
	
	Если Приложение = Неопределено Тогда
		Приложение = Новый Структура("Пользовательское, Версия, Скрытое, Презентация", Неопределено, Неопределено, Неопределено, Неопределено);
	КонецЕсли;
	
	Если НЕ ПриложениеДоступно(Приложение.Пользовательское) Тогда
		
		Попытка
			Приложение.Пользовательское = Новый COMObject("PowerPoint.Application");		
		Исключение
			Приложение.Пользовательское = Неопределено;
		КонецПопытки;			
		
	КонецЕсли;	

	Если НЕ ПриложениеДоступно(Приложение.Скрытое) Тогда
		
		Попытка
			Приложение.Скрытое = Новый COMObject("PowerPoint.Application");					
		Исключение
			Приложение.Скрытое = Неопределено;
		КонецПопытки;
		
		
	КонецЕсли;		
	
	Если НЕ ПриложениеДоступно(Приложение.Пользовательское)
		ИЛИ НЕ ПриложениеДоступно(Приложение.Скрытое) Тогда
		
		Приложение = Неопределено;
		ПоказатьПредупреждение(,НСтр("ru = 'Ошибка инициализации приложения'"));
		Возврат;
		
	КонецЕсли;
	
	Если Приложение.Версия = Неопределено Тогда
		Приложение.Версия = Число(ОбщегоНазначенияСУКлиентСервер.РасщепитьСтроку(Приложение.Пользовательское.Version, ".")[0]);	
	КонецЕсли;
	
	// Открываем презентацию
	//
	
	// Формируем рабочий каталог для работы с документом
	
	Если РабочийКаталог = Неопределено Тогда
		
		РабочийКаталог = Новый Структура("Путь, Презентация, Копия, ФайлДляСохранения");
		
		РабочийКаталог.Путь = ПолучитьИмяВременногоФайла("");
		
		СоздатьКаталог(РабочийКаталог.Путь);
		
		РабочийКаталог.Путь = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(РабочийКаталог.Путь);			
		
		// Путь для сохранения документа
		
		РабочийКаталог.Презентация = РабочийКаталог.Путь + "ppt";
		
		СоздатьКаталог(РабочийКаталог.Презентация);
		
		РабочийКаталог.Презентация = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(РабочийКаталог.Презентация);
		
		// Путь для хранения копии документа
		
		РабочийКаталог.Копия = РабочийКаталог.Путь + "copy";
		
		СоздатьКаталог(РабочийКаталог.Копия);
		
		РабочийКаталог.Копия = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(РабочийКаталог.Копия);		
		
	КонецЕсли;		
	
	// Открываем документ в пользовательском приложении
	
	Если НЕ ПрезентацияДоступна() Тогда
	
		ДобавитьОбработчик Приложение.Пользовательское.PresentationBeforeSave, ПередЗаписьюПрезентации;
		
		Если СсылкаНаЗагруженныйФайл = Неопределено Тогда // Нет файла для открытия
			
			Приложение.Презентация = Приложение.Пользовательское.Presentations.Add();
			
			Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
				Объект.Наименование = НСтр("ru = 'Презентация'");
			КонецЕсли;

			ПропуститьЗаписьДокумента = Истина;
			
			Если Приложение.Версия < 12 Тогда
				
				Приложение.Презентация.SaveAs(РабочийКаталог.Презентация + Объект.Наименование + ".ppt");
				
			Иначе
				
				Приложение.Презентация.SaveAs(РабочийКаталог.Презентация + Объект.Наименование);
				
			КонецЕсли;		
			
		Иначе
			
			ПолучитьФайл(СсылкаНаЗагруженныйФайл, РабочийКаталог.Презентация + ИмяФайлаПрезентации, Ложь);
			
			Приложение.Презентация = Приложение.Пользовательское.Presentations.Open(РабочийКаталог.Презентация + ИмяФайлаПрезентации);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Приложение.Пользовательское.WindowState = 1;
	
	#КонецЕсли	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ОбновитьСсылкуНаЗагруженныйФайл()
	
	// Устанавливаем реквизит формы СсылкаНаЗагруженныйФайл,
	// который хранит ссылку на презентацию, сохраненный в базе.
	
	Если НЕ ЗначениеЗаполнено(Объект.Презентация) Тогда
		СсылкаНаЗагруженныйФайл = Неопределено;
		Возврат;
	КонецЕсли;	
	
	// Получаем данные файла с презентацией
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФайлыСУЗ.Ссылка,
		|	ФайлыСУЗ.ИмяФайла,
		|	ФайлыСУЗ.Версия,
		|	ФайлыСУЗ.Поставщик
		|ИЗ
		|	Справочник.ФайлыСУЗ КАК ФайлыСУЗ
		|ГДЕ
		|	ФайлыСУЗ.Владелец = &Презентация
		|	И ФайлыСУЗ.ЭтоГруппа = ЛОЖЬ
		|	И ФайлыСУЗ.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Презентация", Объект.Презентация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() <> 1 Тогда
		ВызватьИсключение НСтр("ru = 'Набор файлов, содержащий презентацию, поврежден'");
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	ДанныеФайла = ВыборкаДетальныеЗаписи;
	
	ИмяФайлаПрезентации = ДанныеФайла.ИмяФайла;	
	
	СсылкаНаЗагруженныйФайл = РегистрыСведений.ДанныеФайлыСУЗ.АдресХраненияДвоичныхДанных(ДанныеФайла.Ссылка, ДанныеФайла.Поставщик, ДанныеФайла.Версия, "ДвоичныеДанные", УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКоличествоСлайдов()
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		СтраницыПодборки = Справочники.ПодборкиСУЗ.ПолучитьГруппыЭлементовПодборки(Объект.Ссылка);
		
		КоличествоСлайдов = СтраницыПодборки.Количество();	
		
	Иначе
		
		КоличествоСлайдов = 0;
		
	КонецЕсли
	
КонецПроцедуры

// Свойства приложения

&НаКлиенте
Функция ПриложениеДоступно(ПриложениеCOM)
	
	Возврат ОбщегоНазначенияСУКлиент.ПриложениеCOMДоступно(ПриложениеCOM);
	
КонецФункции

&НаКлиенте
Функция ПрезентацияДоступна()
	
	Если Приложение = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;

	Если Приложение.Презентация = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;	
	
	Если НЕ ПриложениеДоступно(Приложение.Пользовательское) Тогда
		Возврат Ложь;
	КонецЕсли;	
	
	Если НЕ ПриложениеДоступно(Приложение.Скрытое) Тогда
		Возврат Ложь;
	КонецЕсли;	
	
	ИмяПрезентации = Неопределено;
	
	Попытка
		ИмяПрезентации = Приложение.Презентация.Name;
	Исключение
		Приложение.Презентация = Неопределено;
	КонецПопытки;
	
	Возврат ?(ИмяПрезентации = Неопределено, Ложь, Истина);
	
КонецФункции

&НаКлиенте
Функция ДокументМодифицирован()
	
	Если НЕ ПрезентацияДоступна() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Приложение.Презентация.Saved Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции


// События приложения

&НаКлиенте
Процедура ПередЗаписьюПрезентации(Presentation, Cancel)   
	
	Если ПропуститьЗаписьДокумента Тогда
		ПропуститьЗаписьДокумента = Ложь;
		Возврат;
	КонецЕсли;
	
	Если Presentation = Приложение.Презентация Тогда
		Cancel = Истина;				
		ПодключитьОбработчикОжидания("ПередЗаписьюПрезентацииПродолжение", 0.01, Истина);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписьюПрезентацииПродолжение()   
	
	СохранитьДокумент(Ложь);
	
КонецПроцедуры

// Действия с документом

&НаКлиенте
Процедура СохранитьДокумент(Синхронно)

	// Сохраняем документ
	
	Если ПрезентацияДоступна() Тогда
		
		ПропуститьЗаписьДокумента = Истина;
		
		Попытка
			Приложение.Презентация.Save();
		Исключение
			// PPT BUG: PowerPoint сохраняет презентацию,
			// даже если сохранение отменено и закрывает
			// приложение принудительно. Поэтому мы не ждем
			// сохранения, а пытаемся сохранить в базу то, что есть.
		КонецПопытки;		
		
		ПропуститьЗаписьДокумента = Ложь;
		
	КонецЕсли;
		
	// Делаем копию документа
	
	РабочийКаталог.ФайлДляСохранения = РабочийКаталог.Копия + ИмяФайлаПрезентации;
	
	КопироватьФайл(РабочийКаталог.Презентация + ИмяФайлаПрезентации, РабочийКаталог.ФайлДляСохранения);
	
	// Сохраняем копию в HTML
	
	Если Синхронно Тогда
		СохранитьДокументПродолжение();
	Иначе
		ПодключитьОбработчикОжидания("СохранитьДокументПродолжение", 0.01, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьДокументПродолжение()
	
	ПропуститьСохранениеДокумента = Истина;
	
	ПараметрыЗагрузки = Новый Структура();	
	
	// Свойства загрузки
					
	ПараметрыЗагрузки.Вставить("ПутьКПрезентации", РабочийКаталог.ФайлДляСохранения);
	ПараметрыЗагрузки.Вставить("Приложение", Приложение.Скрытое);
	ПараметрыЗагрузки.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);					
	ПараметрыЗагрузки.Вставить("КонтекстФайла", "PowerPoint");					

	// Свойства для заполнения в процессе загрузки
	
	ПараметрыЗагрузки.Вставить("СтруктураФайлов", Новый Массив);
	ПараметрыЗагрузки.Вставить("ПередаваемыеФайлы", Новый Массив);					
	ПараметрыЗагрузки.Вставить("ПереданныеФайлы", Новый Массив);
	
	РазработкаСУЗКлиент.СформироватьПрезентациюДляСохраненияВБазе(ПараметрыЗагрузки);	
	
	ФайлыДляСохранения    = Новый Фиксированныймассив(ПараметрыЗагрузки.ПереданныеФайлы); // Сохраняем в реквизит
	
	РабочийКаталог.ФайлДляСохранения = Неопределено;
	
	Записать();
	
КонецПроцедуры

#КонецОбласти

#Область ОператорыОсновнойПрограммы

// УСТАНОВКА ЗНАЧЕНИЙ ПЕРЕМЕННЫХ

ПропуститьЗаписьДокумента = Ложь;
ПропуститьСохранениеДокумента = Ложь;

#КонецОбласти
